* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA LOCAL
1 EMPLOYEES VIEW OF EMPLOYEES
2 PERSONNEL-ID
2 FIRST-NAME
2 NAME
2 CITY
2 DEPT
2 SEX
2 SALARY (3)
END-DEFINE
*
FORMAT LS=132
FIND EMPLOYEES WITH NAME = 'SMITH'
DISPLAY PERSONNEL-ID NAME FIRST-NAME CITY DEPT SALARY (1) SALARY (2) SALARY (3)
END-FIND
*
END

