* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA LOCAL
1 VISAO VIEW OF EMPLOYEES
  2 PERSONNEL-ID
  2 NAME
  2 CITY
  2 DEPT
  2 SEX
  2 LEAVE-START (1)
*
1 #I (P9)
1 #K (A1)
END-DEFINE
FORMAT LS=80 PS=60
READ  VISAO by PERSONNEL-ID
  WRITE PERSONNEL-ID NAME DEPT CITY /*
  / LEAVE-START (1)
*
  FOR #I 1 TO 100000
    MOVE ' ' TO #K
  END-FOR
  SET CONTROL 'N'

*  DELETE (0019)
END-READ
*
END
