* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* <Natural Source Header
/** Program TEST-EMP.
/**
/** :author ziv / napoli
/**
/**  versão 2019/09/10

 DEFINE DATA LOCAL
 1 CALLDATA
 2 #LOOPCOUNT (I4) INIT<10>
 2 #PERSID(A08) INIT <'50005000'>
 2 #FIRST-NAME (A20)
 2 #NAME (A20)
 2 #ZIP (A6)
 2 #CITY (A20)
 2 #COUNTRY (A03)
 2 #DEPT (A6)
 2 #AREA-CODE (A6)
 2 #PHONE (A15)
 2 #JOB-TITLE (A25)
 2 #MESSAGE (A40)
 END-DEFINE

CALLNAT 'EMP-GET' CALLDATA

WRITE 'Database response' /
  'Employee-Get for' #PERSID //
  'Primeiro Nome:' #FIRST-NAME /
  'Sobrenome:' #NAME /
  'CEP:' #ZIP /
  'Cidade:' #CITY /
  'Pais:' #COUNTRY /
  'Departamento:' #DEPT /
  'Fone:' #AREA-CODE #PHONE /
  'Cargo:' #JOB-TITLE //
  'Mensagem:' #MESSAGE

END
