DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
/** New Parameter Data Area XXCONPDA.
/**
/** :author mnap
/* TODO Enter your data definitions here
 1 #P-CONFIRM-UPDATE (A1)
 1 #P-OPTION (A1)
END-DEFINE