* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Subprogram XXCONUPD.
/**
/** :author mnap
/* TODO Enter your code here
DEFINE DATA PARAMETER
USING XXCONPDA
END-DEFINE
SET CONTROL "WL60C10B10/10F"
*
MOVE "N" TO #P-CONFIRM-UPDATE
IF #P-OPTION = "M"
  INPUT / "PLEASE CONFIRM UPDATE! (Y/N)" #P-CONFIRM-UPDATE(AD=TIM)
ELSE
  INPUT / "PLEASE CONFIRM ADDITION! (Y/N)" #P-CONFIRM-UPDATE(AD=TIM)
END-IF
*
SET CONTROL "WB"
*
END